package ru.egar.data;

public enum OpticalHoverData {
    remoteWorkOpticalHover("1726497578026",
            "Удаленный формат \n работы из любого \n города РФ и РБ",
            "1726498598173",
            "Мы стремимся создать комфортные условия работы для каждого, поэтому наши сотрудники могут выбрать удобный формат работы: удаленный, офисный или гибридный."),

    topManagmentOpticalHover("1743848566634",
                              "Открытость \n топ-менеджмента",
                              "1743848566654",
                              "Мы поддерживаем доброжелательную атмосферу внутри коллектива, вместе узнаем новое, совершенствуем процессы и свободно обсуждаем волнующие вопросы."),

    indexationOpticalHover("1743848779302",
                              "Регулярная индексация \n заработной платы",
                              "1743848779323",
                              "Мы признаем и ценим заслуги наших сотрудников, поэтому стремимся обеспечивать конкурентную зарплату."),

    dmsOpticalHover("1743848779270",
            "Программа ДМС со стоматологией и обслуживание в лучших клиниках города",
            "1743848779284",
            "Мы заботимся о наших сотрудниках, поэтому каждый, кто успешно прошел испытательный срок, будет подключен к корпоративной медицинской программе."),

    insuranceOpticalHover("1743849077943",
            "Страхование \n от критических заболеваний",
            "1743849077949",
            "Мы заботимся о наших сотрудниках, поэтому в наш социальный пакет входит расширенная страховка, которая покрывает лечение тяжелых заболеваний."),

    sickDayOpticalHover("1743849077910",
            "4 дополнительных дня отсутствия \n на рабочем месте \n в год",
            "1743849077916",
            "Помимо основного оплачиваемого отпуска, каждый сотрудник может взять в год до 4 дополнительных дней отсутствия на рабочем месте, которые будут оплачены в полном объеме."),

    techOpticalHover("1743849316415",
            "Предоставление качественной техники с первого дня работы",
            "1743849316410",
            "Чтобы создать комфортные условия труда, мы предоставляем необходимую для работы технику."),

    educationOpticalHover("1743849316373",
            "Программы обучения и повышения квалификации, возможность внутренней ротации",
            "1743849316378",
            "Мы поддерживаем желание наших сотрудников развиваться, способствуем обмену опытом внутри компании, а также росту компетенций каждого члена команды."),

    accreditationOpticalHover("1743849719917",
            "Компания аккредитована Минцифры",
            "1743849719921",
            "Мы аккредитованы Минцифры, а это значит, что нашим сотрудникам доступны льготные программы кредитования, а также отсрочка от армии и мобилизации.");


    public final String titleId;
    public final String title;
    public final String resultId;
    public final String result;

    OpticalHoverData(String titleId, String title, String resultId, String result) {
        this.titleId = titleId;
        this.title = title;
        this.resultId = resultId;
        this.result = result;
    }
}
